#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.nat-gateway-ip will be created
  + resource "aws_eip" "nat-gateway-ip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + vpc               = true
    }

  # aws_nat_gateway.nat-gateway will be created
  + resource "aws_nat_gateway" "nat-gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0b1c3af001915ce73"
    }

  # aws_route_table.private-routes will be updated in-place
  ~ resource "aws_route_table" "private-routes" {
        id               = "rtb-0eb6ea99032824a8c"
        owner_id         = "377434098968"
        propagating_vgws = []
      ~ route            = [
            {
                cidr_block                = "0.0.0.0/0"
                egress_only_gateway_id    = ""
                gateway_id                = ""
                instance_id               = ""
                ipv6_cidr_block           = ""
                nat_gateway_id            = (known after apply)
                network_interface_id      = ""
                transit_gateway_id        = ""
                vpc_peering_connection_id = ""
            },
          - {
              - cidr_block                = "0.0.0.0/0"
              - egress_only_gateway_id    = ""
              - gateway_id                = "igw-0784d24de6e76e237"
              - instance_id               = ""
              - ipv6_cidr_block           = ""
              - nat_gateway_id            = ""
              - network_interface_id      = ""
              - transit_gateway_id        = ""
              - vpc_peering_connection_id = ""
            },
        ]
        tags             = {
            "Name" = "nasipolitici-private-routes"
        }
        vpc_id           = "vpc-0c53fe02d84d085b4"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan on PR`, Action: `hashicorpterraform-github-actions3`, Working Directory: `infrastructure/aws`, Workspace: `default`*
